cases/polyCelerity/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     multiphaseEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         15;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;

maxDeltaT       1;

libs
(
    "libLogMoM.so"
);

functions
{
    #include "functions"

    sample
    {
        type                sets;
        libs                ("libsampling.so");
        writeControl        writeTime;
        interpolationScheme cellPoint;
        setFormat           raw;
        name                sample;
        sets
        (
            outlet
            {
                type    lineUniform;
                axis    x;
                start   (0.0001 9.999 0);
                end     (0.0974 9.999 0);
                nPoints 32;
            }

            r0p0
            {
                type    lineUniform;
                axis    y;
                start   (0.001 0.001 0);
                end     (0.001 9.999 0);
                nPoints 256;
            }

            r0p05
            {
                type    lineUniform;
                axis    y;
                start   (0.05 0.001 0);
                end     (0.05 9.999 0);
                nPoints 256;
            }
        );
        fields
        (
            #include "sampleFields"
        );
    }
}
