cases/polyCelerity/constant/momentumTransport.air
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.air;
}

simulationType  laminar;
