cases/polyCelerity/constant/fvModels
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

maxDeltaT
{
    type    polyMaxDeltaT;
}
