cases/polyCelerity/constant/templates/drag.m4
VARPHASEPAIR
{
    type        TomiyamaCorrelated;
    A           24.0;
    residualRe  1e-3;
}
