cases/polyCelerity/constant/templates/lift.m4
VARPHASEPAIR
{
    type    hyperbolic;
    C1      0.288;
    C2     -0.288;
    d       0.005;
    C       2.0;
}
