cases/polyCelerity/constant/templates/surfaceTension.m4
VARPHASEPAIR
{
    type    constant;
    sigma   0.07197;
}
