cases/polyCelerity/constant/templates/turbulentDispersion.m4
VARPHASEPAIR
{
    type            LopezDeBertodano;
    Ctd             1;
    residualAlpha   1e-16;
}
