cases/polyCelerity/constant/templates/virtualMass.m4
VARPHASEPAIR
{
    type    constantCoefficient;
    Cvm     0.5;
}
