cases/polyCelerity/0.org/U.air.m4
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.VARPHASENAME;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1.2 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.VARPHASENAME;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
    wedgeFront
    {
        type            wedge;
    }
    wedgeBack
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}
