cases/polyCelerity/system/templates/functionF.m4
VARFUNCTIONNAME
{
    type            surfaceFieldValue;
    regionType      patch;
    name            VARPATCHNAME;
    fields          (VARFFIELD);
    operation       sum;
    weightField     VARALPHAFLUX;
    writeControl    writeTime;
    writeFields     false;
}
